import {IProduct} from '../models/product';

export const products: Array<IProduct> = [
  {
    id: 1,
    title:
      "КРЫСА МУТАНТ СЕКСИСТ (ФИНАЛ СЕЗОНА)",
    author: "Елизавета Стоянова ",
    description: "Дисклеймер: от прослушивания данного аудио-подкаста появится желание запастись тушенкой и спрятаться под одеяло.\n" +
      "\n" +
      "Слушай до последней секунды, чтобы ничего не упустить.\n" +
      "\n" +
      "Самый шокирующий эпизод подкаста «Не в своей тарелке» уже перед тобой, осталось нажать плэй.",
    genre: "Фантастика,Мистика",
    image: "https://cv3.litres.ru/pub/c/cover_330/68897634.webp",
    language: "Русский ",
    pages: 67,
  },
  {
    id: 2,
    title: "Робинзон Крузо",
    author: "Даниэль Дефо",
    description: "Популярный роман английского писателя Даниэля Дефо об удивительных приключениях Робинзона Крузо, прожившего двадцать восемь лет в полном одиночестве на необитаемом острове.",
    genre: "Детское ,Приключение, Foreign classics,Зарубежные детские книги, литература XVIII века.",
    image: "https://cv4.litres.ru/pub/c/cover_415/148548.webp",
    language: "Испанский",
    pages: 260,

  }, {
    id: 3,
    title: "Жилой комплекс «Курицын»",
    author: "Дмитрий Петров",
    description: "Победитель премии \"Книготерапия\" от ЛитРес. Роман-авантюра о том, что происходит на стройке, пока вы платите ипотеку. Любовный треугольник на глазах у дольщиков. В день ареста влиятельного шефа юный мечтатель Саша Попов остаётся с миллионом долларов в руках. Шеф из заточения велит строить на эти деньги жилой комплекс. Он хочет банально кинуть дольщиков, а наивный Саша всерьёз берётся за возведение дома мечты, и все вокруг норовят обмануть, украсть, подставить, а срок сдачи дома неумолимо приближается… Провинциальному тихоне предстоит вырасти из гайдаевского Шурика в Майкла Корлеоне, построить самый красивый дом в городе и найти любовь. Все имена и события вымышлены, любые совпадения случайны. Автор ни разу не указывает, где происходит действие, но читатели угадывают свой город безошибочно.",
    genre: "Современная русская литература, Современные любовные романы, Юмор и сатира",
    image: "https://cv6.litres.ru/pub/c/cover_415/68807766.webp",
    language: "Русский",
    pages: 260,
  }, {
    id: 4,
    title: "Оппенгеймер. История создателя ядерной бомбы",
    author: "Кай Берд",
    description: "Гениальный физик Роберт Оппенгеймер совершенно не интересовался политикой. По его словам, он в первый раз в жизни проголосовал только в 1936 году. Полностью погруженный в науку, он часто поражал друзей и коллег своими странностями. Типичный чудак-ученый не предполагал, что политика придет в его жизнь вслед за наукой. Исследования Оппенгеймера относились к теоретической астрофизике, тесно связанной с общей теорией относительности и теорией атомного ядра, ядерной физике. Это привело талантливого физика в Манхэттенский проект, занимавшийся разработкой ядерного оружия… О том, как сложилась жизнь «отца атомной бомбы» и как новое оружие изменило жизнь ученого, читайте в новой биографии Роберта Оппенгеймера." ,
    genre: "Биография",
    image: "https://cv2.litres.ru/pub/c/cover_415/69469723.webp",
    language:"Английский",
    pages:1020
  },
  {
    id: 5,
    title: "Рик и Морти. Путеводитель по самому гениальному мультфильму всех галактик",
    author: "Мэтт Брэди",
    description: "«Рик и Морти» – один из самых умных и безумных мультсериалов последнего времени. Гений и по совместительству алкоголик Рик Санчез и его злополучный внучок Морти постоянно влипают в самые пикантные ситуации на просторах огромной Вселенной с параллельными мирами. В каждой серии они используют новейшие достижения науки. Но если заглянуть за пределы лаборатории Рика в гараже, что из показанного нам является правдой и будет реализовано в недалеком будущем?\n" +
      "\n" +
      "Из книги вы узнаете, как мы можем использовать темную материю и энергию, что такое биохакинг, возможно ли контролировать нервную систему таракана при помощи языка и многое другое.",
    genre: "Популярное",
image: "https://cv1.litres.ru/pub/c/cover_415/51797816.webp",
  language:"Французский",
  pages:336
},
{
  id: 6,
    title: "Следствие ведут Колобки (сборник)",
  author: "Эдуард Успенский",
  description: "В одном парке культуры и отдыха стоит небольшой домик. В нём работают Колобки – детективы самого высокого уровня с безупречной репутацией. Они находят пропавших детей, произведения искусства, предотвращают экологические катастрофы и разоблачают коварных преступников. Эти суровые спецы прочно заняли своё место среди знаменитых сыщиков – Шерлока Холмса, Ниро Вульфа и Эраста Фандорина. Разница только в том, что Колобки Э. Успенского – самые детские детективы во всём мире. Книга «Следствие ведут Колобки» впервые выходит с новыми иллюстрациями Н. Бугославской.\n" +
"\n" +
"Для младшего школьного возраста.",
  genre: "Детское , Детектив",
  image: "https://cv0.litres.ru/pub/c/cover_415/419502.webp",
  language: "Испанский",
  pages:336
},

]
